# YOLOv8-ES: Enhanced Road Crack Detection Model
# EXPLICIT SCALING VERSION (Fixes Channel Mismatch)

nc: 4
# We manually scaled the width, so we set width_multiple to 1.0
# We keep depth_multiple at 0.33 for the layer repetition count
depth_multiple: 0.33
width_multiple: 1.0  

backbone:
  # [from, repeats, module, args]
  # Layer 0: Conv [16, 3, 2] (Originally 64 * 0.25)
  - [-1, 1, Conv, [16, 3, 2]]          # 0-P1/2
  
  # Layer 1: EDCM [32, 3, 1] (Originally 128 * 0.25)
  # Input is 16 (from L0), Output is 32.
  - [-1, 1, EDCM, [32, 3, 1]]          # 1-P2/4 
  
  - [-1, 3, C2f, [32, True]]           # 2
  - [-1, 1, Conv, [64, 3, 2]]          # 3-P3/8
  - [-1, 6, C2f, [64, True]]           # 4
  - [-1, 1, Conv, [128, 3, 2]]         # 5-P4/16
  - [-1, 6, C2f, [128, True]]          # 6
  - [-1, 1, Conv, [256, 3, 2]]         # 7-P5/32
  - [-1, 3, C2f, [256, True]]          # 8
  - [-1, 1, SPPF, [256, 5]]            # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]          # 11
  - [-1, 3, C2f, [128]]                # 12
  
  # Layer 13: SGAM [128] (Originally 512 * 0.25)
  - [-1, 1, SGAM, [128]]               # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]          # 15
  - [-1, 3, C2f, [64]]                 # 16

  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]         # 18 (Cat with SGAM)
  - [-1, 3, C2f, [128]]                # 19

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]          # 21
  - [-1, 3, C2f, [256]]                # 22

  - [[16, 19, 22], 1, Detect, [nc]]    # 23