# YOLOv8-ES: Enhanced Road Crack Detection Model
# Based on Figure 1 of "Efficient and accurate road crack detection technology based on YOLOv8-ES"

nc: 4                   # number of classes (RDD2022 has 4: longitudinal, transverse, alligator, pothole)
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n usage: depth=0.33, width=0.25

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  
  # --- ES Modification: EDCM ---
  # Replaces or augments the standard P2 block. 
  # Argument '128' is scaled by width_multiple(0.25) -> 32 channels.
  - [-1, 1, EDCM, [128, 3, 1]]         # 1-P2/4 (Enhanced Dynamic Convolution)
  
  - [-1, 3, C2f, [128, True]]          # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 6, C2f, [256, True]]          # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 6, C2f, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 3, C2f, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]          # 11 cat backbone P4
  - [-1, 3, C2f, [512]]                # 12
  
  # --- ES Modification: SGAM ---
  # Selectively attends to global features before passing them to P3
  # Argument '512' scaled by 0.25 -> 128 channels
  - [-1, 1, SGAM, [512]]               # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]          # 15 cat backbone P3
  - [-1, 3, C2f, [256]]                # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]         # 18 cat SGAM output (Refined P4)
  - [-1, 3, C2f, [512]]                # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]          # 21 cat head P5
  - [-1, 3, C2f, [1024]]               # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]    # Detect(P3, P4, P5)